# берем образ Python версии 3.10.19
FROM python:3.10.19
# указываем рабочую директорию с приложением
WORKDIR /app
# копируем файлы в контейнер
COPY . .
# выполняем команды во время сборки образа
# 1. Создаем пользователя, от имени которого
#  будет работать приложение
# 2. устанавливаем Python зависимости
RUN useradd -m appmanager && \
  pip3 install -r requirements.txt
# указываем пользователя, от имени которого
# будет работать контейнер
USER appmanager
# объявляем порт, использумый приложением
EXPOSE 8080
# определяем команду для запуска приложения
# внутри контейнера
ENTRYPOINT ["python3", "main.py"]
